PANDAS PROBLEMS

In [3]:
import pandas as pd
import numpy as np

1. Write a Python program to create and display a one-dimensional array-like object
containing an array of data using Pandas module.

In [4]:

data = np.array([10, 20, 30, 40, 50])
series = pd.Series(data)

print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

2. Write a Python program to convert a Panda module Series to Python list and it's type

In [6]:
series = pd.Series([10, 20, 30, 40, 50])
data_list = series.tolist()
print(data_list)

[10, 20, 30, 40, 50]

3. Write a Python program to add, subtract, multiple and divide two Pandas Series.

In [13]:
series1 = pd.Series([2, 4, 6, 8, 10])
series2 = pd.Series([1, 3, 5, 7, 9])

add = series1 + series2
sub = series1 - series2
mul = series1 * series2
div = series1 // series2

print(add, "\n", sub, "\n", mul, "\n", div)

0     3
1     7
2    11
3    15
4    19
dtype: int64
 0    1
1    1
2    1
3    1
4    1
dtype: int64
 0     2
1    12
2    30
3    56
4    90
dtype: int64
 0    2
1    1
2    1
3    1
4    1
dtype: int64

4. Write a Python program to get the powers of an array values element-wise.
Note: First array elements raised to powers from second array

In [22]:
series1 = pd.Series([0, 1, 2, 3, 4, 5, 6])
power = [0, 1, 3, 3, 3, 3, 3]
# print(series1.pow(2))
# print(series1.pow(series1))
print(series1.pow(power))

0      1
1      1
2      8
3     27
4     64
5    125
6    216
dtype: int64

5. Write a Python program to create and display a DataFrame from a specified dictionary
data which has the index labels.

In [20]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

6. Write a Python program to display a summary of the basic information about a
specified Data Frame and its data.

In [26]:
# Displays basic information about the DataFrame
df.info()
# Summary statistics for numerical columns
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

7. Write a Python program to get the first 3 rows of a given DataFrame.

In [36]:
#  integer-location-based indexing.
# DataFrame.iloc[row_index, column_index]
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

8. Write a Python program to select the 'name' and 'score' columns from the following
DataFrame

In [29]:
# df[['name', 'score', 'qualify']]
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

9. Write a Python program to select the specified columns and rows from a given data
frame Select 'name' and 'score' columns in rows 1, 3, 5, 6

In [30]:
df.iloc[[1, 3, 5, 6], [1, 3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

10. Write a Python program to select the rows where the number of attempts in the
examination is greater than 2.

In [37]:
df[df['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

11. Write a Python program to count the number of rows and columns of a DataFrame

In [42]:
# df.shape returns tuple(row,column)
print(f"Rows: {df.shape[0]}\nColumn: {df.shape[1]}")

Rows: 10
Column: 4

12. Write a Python program to select the rows where the score is missing, i.e. is NaN.

In [44]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

13. Write a Python program to select the rows where number of attempts in the
examination is less than 2 and score greater than 15.

In [51]:
df[(df['attempts'] < 2) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

14. Write a Python program to change the score in row 'd' to 11.5.

In [60]:
# df.loc label-based data selection method. 
# DataFrame.loc[row_labels, column_labels]
df.loc['d', 'score'] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

15. Write a Python program to calculate the sum of the examination attempts by the
students.

In [63]:
print(df['attempts'].sum())

19

16. Write a Python program to calculate the mean score for each different student in
DataFrame

In [64]:
print(df['score'].mean())

13.333333333333334

17. Write a Python program to append a new row 'k' to data frame with given values for
each column. Now delete the new row and return the original DataFrame

In [69]:
df.loc['k'] = ["Suresh", 15.5,  1, "yes"]
print(df)
# The drop() method removes the specified row or column.
df.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

18. Write a Python program to sort the DataFrame first by 'name' in descending order,
then by 'score' in ascending order

In [70]:
# The sort_values() method sorts the DataFrame by the specified label.
# dataframe.sort_values(by, axis, ascending, inplace, kind, na_position, ignore_index, key)
# by default ascending = True
df.sort_values(by=['name', 'score'], ascending=[False, True])

        name  score  attempts qualify
k     Suresh   15.5         1     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

19. Write a Python program to replace the 'qualify' column contains the values 'yes' and
'no' with True and False.

In [73]:
# df.replace() is used to replace specific values in a DataFrame or Series
# DataFrame.replace(to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad')
# Setting the option to follow future behavior (no silent downcasting)
pd.set_option('future.no_silent_downcasting', True)
df['qualify'] = df['qualify'].replace({'yes': True, 'no': False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k     Suresh   15.5         1     True

20. Write a Python program to delete the 'attempts' column from the DataFrame

In [75]:
df.drop(columns='attempts')

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True
k     Suresh   15.5     True

21. Write a Python program to insert a new column in existing DataFrame.

In [80]:
df['attempts'] = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1,2]
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k     Suresh   15.5         2     True

22. Write a Python program to iterate over rows in a DataFrame

In [82]:
# df.iterrows() iterate over the rows of a DataFrame as (index, Series) pairs.
for index, row in df.iterrows():
    print(f"Index: {index}")
    print(f"Name: {row['name']}, Scor: {row['score']}, Attempts: {row['attempts']}, Qualify: {row['qualify']}")

Index: a
Name: Anastasia, Scor: 12.5, Attempts: 1, Qualify: True
Index: b
Name: Dima, Scor: 9.0, Attempts: 3, Qualify: False
Index: c
Name: Katherine, Scor: 16.5, Attempts: 2, Qualify: True
Index: d
Name: James, Scor: 11.5, Attempts: 3, Qualify: False
Index: e
Name: Emily, Scor: 9.0, Attempts: 2, Qualify: False
Index: f
Name: Michael, Scor: 20.0, Attempts: 3, Qualify: True
Index: g
Name: Matthew, Scor: 14.5, Attempts: 1, Qualify: True
Index: h
Name: Laura, Scor: nan, Attempts: 1, Qualify: False
Index: i
Name: Kevin, Scor: 8.0, Attempts: 2, Qualify: False
Index: j
Name: Jonas, Scor: 19.0, Attempts: 1, Qualify: True
Index: k
Name: Suresh, Scor: 15.5, Attempts: 2, Qualify: True

23. Write a Python program to get list from DataFrame column headers.

In [84]:
columns_list = list(df.columns)

print(columns_list)

['name', 'score', 'attempts', 'qualify']